Repository: frankbracq/genealorama4wp
Catalog: languages/secure-iframe-embed-for-genealorama-*.po
Languages: fr_fr

source: Secure Iframe Embed for Genealorama Settings
fr_fr: Paramètres d'intégration sécurisée par iframe pour Genealorama

source: Partner Credentials
fr_fr: Identifiants partenaire

source: Administrator Email
fr_fr: Email administrateur

source: Used to create your partner account
fr_fr: Utilisé pour créer votre compte partenaire

source: Connect to Genealorama
fr_fr: Se connecter à Genealorama

source: Partner ID
fr_fr: ID Partenaire

source: Partner Secret
fr_fr: Secret Partenaire

source: Validate Credentials
fr_fr: Valider les identifiants

source: Display Options
fr_fr: Options d'affichage

source: Customize the appearance of the embedded Genealorama
fr_fr: Personnaliser l'apparence de Genealorama intégré

source: Show as Full Screen
fr_fr: Afficher en plein écran

source: How to Use
fr_fr: Comment utiliser

source: Page Template
fr_fr: Modèle de page

source: Create a new page and select 'Genealorama Page Template' from the page attributes
fr_fr: Créez une nouvelle page et sélectionnez 'Modèle de page Genealorama' dans les attributs de page

source: Use [genealorama_embed] in any page or post
fr_fr: Utilisez [genealorama_embed] dans n'importe quelle page ou article

source: Custom Integration
fr_fr: Intégration personnalisée

source: For advanced integration, see our documentation
fr_fr: Pour une intégration avancée, consultez notre documentation

source: Partner ID and Secret not configured.
fr_fr: ID Partenaire et Secret non configurés.

source: Please update them
fr_fr: Veuillez les mettre à jour

source: Credentials are valid!
fr_fr: Les identifiants sont valides !

source: Invalid credentials. Please check your Partner ID and Secret.
fr_fr: Identifiants invalides. Veuillez vérifier votre ID Partenaire et votre Secret.

source: Display options saved successfully!
fr_fr: Options d'affichage enregistrées avec succès !

source: Settings
fr_fr: Paramètres

source: Container Width
fr_fr: Largeur du conteneur

source: Container Height
fr_fr: Hauteur du conteneur

source: Save Display Options
fr_fr: Enregistrer les options d'affichage

source: Credentials for secure authentication with Genealorama
fr_fr: Identifiants pour l'authentification sécurisée avec Genealorama

source: With Genealorama, you offer your site visitors a unique interactive genealogical experience based on their GEDCOM files.
fr_fr: Avec Genealorama, vous offrez aux visiteurs de votre site une expérience généalogique interactive unique basée sur leurs fichiers GEDCOM.

source: Connected to Genealorama
fr_fr: Connecté à Genealorama

source: Last check:
fr_fr: Dernière vérification :

source: Automatically detected domain
fr_fr: Domaine détecté automatiquement

source: Shortcode Options
fr_fr: Options de Shortcode

source: You can customize each integration:
fr_fr: Vous pouvez personnaliser chaque intégration :
