Repository: frankbracq/genealorama4wp
Catalog: languages/wp-plugins-secure-iframe-embed-for-genealorama-stable-readme-*.po
Languages: fr

source: Secure iframe integration to embed the Genealorama web application into WordPress sites with dedicated page templates and credential validation.
fr: Intégration sécurisée d'iframe pour intégrer l'application web Genealorama dans les sites WordPress avec des modèles de page dédiés et une validation des identifiants.

source: Secure Iframe Embed for Genealorama
fr: Intégration Sécurisée Iframe pour Genealorama

source: Yes, the plugin uses HMAC-SHA256 signatures for authentication and requires users to be logged in to WordPress.
fr: Oui, l'extension utilise des signatures HMAC-SHA256 pour l'authentification et exige que les utilisateurs soient connectés à WordPress.

source: Yes, you can use <code>[genealorama_embed]</code> on any page or post.
fr: Oui, vous pouvez utiliser <code>[genealorama_embed]</code> sur n'importe quelle page ou article.

source: No! The plugin automatically creates a genealogy page at <code>/genealorama/</code> with the proper template. Just activate and visit the page.
fr: Non ! L'extension crée automatiquement une page de généalogie à <code>/genealorama/</code> avec le modèle approprié. Il suffit d'activer et de visiter la page.

source: Is the integration secure?
fr: L'intégration est-elle sécurisée ?

source: Can I use the shortcode on multiple pages?
fr: Puis-je utiliser le shortcode sur plusieurs pages ?

source: Do I need to configure anything after installation?
fr: Dois-je configurer quelque chose après l'installation ?

source: To activate integration with genealogie.app:
fr: Pour activer l'intégration avec genealogie.app :

source: Click "Save Settings"
fr: Cliquez sur "Enregistrer les réglages"

source: Credentials are automatically filled and validated
fr: Les identifiants sont automatiquement remplis et validés

source: Enter your <strong>Email</strong> and click "Get My Credentials"
fr: Entrez votre <strong>Email</strong> et cliquez sur "Obtenir mes identifiants"

source: Go to <strong>Settings &gt; Genealorama Settings</strong>
fr: Allez dans <strong>Réglages &gt; Paramètres Genealorama</strong>

source: <strong>Ready!</strong> Visit <code>/genealorama/</code> on your site
fr: <strong>Prêt !</strong> Visitez <code>/genealorama/</code> sur votre site

source: Activate the plugin
fr: Activez l'extension

source: Upload the <code>.zip</code> file via Plugins &gt; Add New &gt; Upload Plugin
fr: Téléchargez le fichier <code>.zip</code> via Extensions &gt; Ajouter &gt; Téléverser une extension

source: Download the latest version from the releases page
fr: Téléchargez la dernière version depuis la page des versions

source: API Keys Configuration
fr: Configuration des clés API

source: These external connections are required for the plugin to function properly and provide secure access to genealogy services.
fr: Ces connexions externes sont nécessaires pour que l'extension fonctionne correctement et fournisse un accès sécurisé aux services de généalogie.

source: This plugin connects to external services to provide genealogy visualization functionality:
fr: Cette extension se connecte aux services externes pour fournir des fonctionnalités de visualisation généalogique :

source: With options: [genealorama_embed auto_height="true" fullscreen="true"]
fr: Avec options : [genealorama_embed auto_height="true" fullscreen="true"]

source: Use the shortcode on any page or post: [genealorama_embed]
fr: Utilisez le shortcode sur n'importe quelle page ou article : [genealorama_embed]

source: <strong>No manual configuration needed</strong> to get started!
fr: <strong>Aucune configuration manuelle nécessaire</strong> pour commencer !

source: Upon activation, the plugin: ✅ <strong>Automatically creates a "Genealogy" page</strong> accessible at <code>/genealorama/</code> ✅ Applies a full-page template (without WordPress header/footer) ✅ Configures integration with the shortcode <code>[genealorama_embed auto_height="true"]</code>
fr: À l'activation, l'extension : ✅ <strong>Crée automatiquement une page "Généalogie"</strong> accessible à <code>/genealorama/</code> ✅ Applique un modèle pleine page (sans en-tête/pied de page WordPress) ✅ Configure l'intégration avec le shortcode <code>[genealorama_embed auto_height="true"]</code>

source: It allows logged-in users to <strong>view, visualize, or interact with genealogical research results</strong> while maintaining secure access rights.
fr: Elle permet aux utilisateurs connectés de <strong>consulter, visualiser ou interagir avec les résultats de recherche généalogique</strong> tout en maintenant des droits d'accès sécurisés.

source: <strong>Secure Iframe Embed for Genealorama</strong> is a WordPress plugin designed to integrate the Genealorama web application into any WordPress site through interactive and secure iframes.
fr: <strong>Intégration Sécurisée Iframe pour Genealorama</strong> est une extension WordPress conçue pour intégrer l'application web Genealorama dans n'importe quel site WordPress via des iframes interactives et sécurisées.

source: <strong>When</strong>: During initial setup when admin clicks "Get My Credentials"
fr: <strong>Quand</strong> : Lors de la configuration initiale lorsque l'administrateur clique sur "Obtenir mes identifiants"

source: <strong>Data sent</strong>: Site domain, admin email, WordPress version, plugin version
fr: <strong>Données envoyées</strong> : Domaine du site, email administrateur, version WordPress, version de l'extension

source: <strong>Service URL</strong>: https://partner-registration.genealogie.app
fr: <strong>URL du service</strong> : https://partner-registration.genealogie.app

source: <strong>Purpose</strong>: Registers WordPress sites as authorized partners for the genealogy service
fr: <strong>Objectif</strong> : Enregistre les sites WordPress comme partenaires autorisés pour le service de généalogie

source: <strong>Privacy Policy</strong>: https://genealorama.com/privacy
fr: <strong>Politique de confidentialité</strong> : https://genealorama.com/privacy

source: <strong>Terms of Service</strong>: https://genealorama.com/terms
fr: <strong>Conditions d'utilisation</strong> : https://genealorama.com/terms

source: <strong>When</strong>: Every time a user loads the genealogy interface
fr: <strong>Quand</strong> : À chaque fois qu'un utilisateur charge l'interface de généalogie

source: <strong>Data sent</strong>: User authentication tokens, timestamps, and signatures for secure access
fr: <strong>Données envoyées</strong> : Jetons d'authentification utilisateur, horodatages et signatures pour un accès sécurisé

source: <strong>Service URL</strong>: https://genealogie.app
fr: <strong>URL du service</strong> : https://genealogie.app

source: <strong>Purpose</strong>: Provides the main genealogy application interface through a secure iframe
fr: <strong>Objectif</strong> : Fournit l'interface principale de l'application de généalogie via une iframe sécurisée

source: <code>fullscreen</code> - Full screen mode (default: <code>false</code>)
fr: <code>fullscreen</code> - Mode plein écran (par défaut : <code>false</code>)

source: <code>auto_height</code> - Automatic height adjustment (default: <code>true</code>)
fr: <code>auto_height</code> - Ajustement automatique de la hauteur (par défaut : <code>true</code>)

source: <code>src</code> - Application URL (default: <code>https://genealogie.app/iframe-entry/</code>)
fr: <code>src</code> - URL de l'application (par défaut : <code>https://genealogie.app/iframe-entry/</code>)

source: 🆕 <strong>Error detection</strong>: Automatic alert if credentials are invalid
fr: 🆕 <strong>Détection d'erreur</strong> : Alerte automatique si les identifiants sont invalides

source: <strong>Iframe isolation</strong>: Secure communication via postMessage
fr: <strong>Isolation iframe</strong> : Communication sécurisée via postMessage

source: <strong>Temporal validation</strong>: Protection against replay attacks
fr: <strong>Validation temporelle</strong> : Protection contre les attaques par rejeu

source: <strong>HMAC signature</strong>: Each request is cryptographically signed
fr: <strong>Signature HMAC</strong> : Chaque requête est signée cryptographiquement

source: <strong>Authentication required</strong>: Users must be logged in to WordPress
fr: <strong>Authentification requise</strong> : Les utilisateurs doivent être connectés à WordPress

source: 🆕 <strong>Credential validation</strong>: Automatic and manual verification of API keys
fr: 🆕 <strong>Validation des identifiants</strong> : Vérification automatique et manuelle des clés API

source: ✅ <strong>Bidirectional communication</strong>: Support for messages between iframe and parent site
fr: ✅ <strong>Communication bidirectionnelle</strong> : Support des messages entre iframe et site parent

source: ✅ <strong>Adaptive height</strong>: Automatic iframe resizing
fr: ✅ <strong>Hauteur adaptative</strong> : Redimensionnement automatique de l'iframe

source: ✅ <strong>Members only</strong>: Access limited to logged-in users
fr: ✅ <strong>Membres uniquement</strong> : Accès limité aux utilisateurs connectés

source: ✅ <strong>Enhanced security</strong>: HMAC-SHA256 signature for authentication
fr: ✅ <strong>Sécurité renforcée</strong> : Signature HMAC-SHA256 pour l'authentification

source: ✅ <strong>Flexible shortcode</strong>: <code>[genealorama_embed]</code> usable on any page
fr: ✅ <strong>Shortcode flexible</strong> : <code>[genealorama_embed]</code> utilisable sur n'importe quelle page

source: ✅ <strong>Immersive template</strong>: Full-page display without distractions
fr: ✅ <strong>Modèle immersif</strong> : Affichage pleine page sans distractions

source: ✅ <strong>Automatic dedicated page</strong>: A <code>/genealorama/</code> page created on activation
fr: ✅ <strong>Page dédiée automatique</strong> : Une page <code>/genealorama/</code> créée à l'activation

source: Partner Registration API
fr: API d'enregistrement des partenaires

source: Genealorama Application Service
fr: Service d'application Genealorama

source: External Services
fr: Services externes

source: Shortcode Parameters
fr: Paramètres du shortcode

source: 📖 Usage
fr: 📖 Utilisation

source: 🔒 Security
fr: 🔒 Sécurité

source: 🔧 Features
fr: 🔧 Fonctionnalités

source: ✨ Automatic Installation
fr: ✨ Installation automatique

source: Shortcode integration example
fr: Exemple d'intégration de shortcode

source: Full-page genealogy interface
fr: Interface de généalogie pleine page

source: Plugin settings page with credential validation
fr: Page de réglages de l'extension avec validation des identifiants

source: Better security measures
fr: Meilleures mesures de sécurité

source: Improved error messaging
fr: Amélioration des messages d'erreur

source: Enhanced admin interface
fr: Interface d'administration améliorée

source: Added automatic credential validation
fr: Ajout de la validation automatique des identifiants

source: Security enhancements
fr: Améliorations de sécurité

source: Improved error handling and user feedback
fr: Amélioration de la gestion d'erreurs et des retours utilisateur

source: Enhanced credential validation system
fr: Système de validation des identifiants amélioré

source: Modern admin interface and technical fixes
fr: Interface d'administration moderne et corrections techniques

source: Enhanced security and authentication
fr: Sécurité et authentification améliorées

source: Fixed wp_enqueue_scripts implementation
fr: Correction de l'implémentation wp_enqueue_scripts

source: Improved WordPress standards compliance
fr: Amélioration de la conformité aux standards WordPress

source: Full English translation
fr: Traduction anglaise complète

source: Complete rebranding to Genealorama
fr: Rebranding complet vers Genealorama

source: Better compliance with WordPress.org guidelines
fr: Meilleure conformité aux directives WordPress.org

source: Enhanced asset management using WordPress uploads directory
fr: Gestion d'actifs améliorée utilisant le répertoire uploads de WordPress

source: Improved build process and GitHub Actions
fr: Amélioration du processus de compilation et des GitHub Actions

source: Fixed text domain to match plugin slug
fr: Correction du domaine de texte pour correspondre au slug de l'extension
